# 그냥 1000000가지 경우 다 구함...
# 근데 언제까지가 1000000까지인지 몰라서 대충 N의 생성자는 N보다 작으니깐 N까지로 돌림

N = int(input())
arr = [0]*1000001
isNo = True
a0 = 0
a1 = 0
a2 = 0
a3 = 0
a4 = 0
a5 = 0
for i in range(1,N):
    a0 = i % 10
    a1 = ((i - a0) // 10) % 10
    a2 = ((i - (a1*10+a0)) // 100) % 10
    a3 = ((i - (a2*100 + a1*10 + a0)) // 1000) % 10
    a4 = ((i - (a3*1000 + a2*100 + a1*10 + a0)) // 10000) % 10
    a5 = ((i - (a4*10000 + a3*1000 + a2*100 + a1*10 + a0)) //100000) % 10
    if arr[i] == 0:
        arr[i] = a5 + a4 + a3 + a2 + a1 + a0 + i
        if arr[i] == N:
            print(i)
            isNo = False
            break
if isNo:
    print(0)